Tests/sysbench_results_r7a.xlarge_20250606_050045.txt
=====================================================================
SYSBENCH COMPREHENSIVE BENCHMARK RESULTS
=====================================================================
Start Time: Fri Jun  6 05:00:45 UTC 2025
Hostname: i-088c3e7d009b5997a.8067.aws-int.thomsonreuters.com
Instance Type: r7a.xlarge
Operating System: Linux i-088c3e7d009b5997a.8067.aws-int.thomsonreuters.com 6.1.130-139.222.amzn2023.x86_64 #1 SMP PREEMPT_DYNAMIC Tue Mar 11 01:10:58 UTC 2025 x86_64 x86_64 x86_64 GNU/Linux
CPU Info: AMD EPYC 9R14 AMD EPYC 9R14
CPU Cores: 4
Memory: 30Gi
=====================================================================

[2025-06-06 05:00:45] Starting Sysbench Comprehensive Benchmark Suite
[2025-06-06 05:00:45] Results will be saved to: sysbench_results_r7a.xlarge_20250606_050045.txt
[2025-06-06 05:00:45] ================================================
[2025-06-06 05:00:45] Checking prerequisites...
[2025-06-06 05:00:45] k6 found - K6 tests will be included
[SUCCESS] Prerequisites check passed
[2025-06-06 05:00:45] Setting up PostgreSQL database and user...
[SUCCESS] PostgreSQL setup completed
[2025-06-06 05:00:45] Starting CPU benchmarks...
[2025-06-06 05:00:45] Detected 4 CPU cores

=====================================================================
SINGLE-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-06 05:00:45] Running single-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 1 eps: 40470.12 lat (ms,95%): 0.03
[ 20s ] thds: 1 eps: 44083.13 lat (ms,95%): 0.03
[ 30s ] thds: 1 eps: 43707.99 lat (ms,95%): 0.03
[ 40s ] thds: 1 eps: 44192.09 lat (ms,95%): 0.02
[ 50s ] thds: 1 eps: 43813.60 lat (ms,95%): 0.02
[ 60s ] thds: 1 eps: 42818.80 lat (ms,95%): 0.02
[ 70s ] thds: 1 eps: 44966.20 lat (ms,95%): 0.02
[ 80s ] thds: 1 eps: 44839.90 lat (ms,95%): 0.02
[ 90s ] thds: 1 eps: 43587.79 lat (ms,95%): 0.02
[ 100s ] thds: 1 eps: 42696.51 lat (ms,95%): 0.02
[ 110s ] thds: 1 eps: 43167.88 lat (ms,95%): 0.02
CPU speed:
    events per second: 43419.81

Throughput:
    events/s (eps):                      43419.8150
    time elapsed:                        120.0002s
    total number of events:              5210386

Latency (ms):
         min:                                    0.02
         avg:                                    0.02
         max:                                    3.44
         95th percentile:                        0.03
         sum:                               119493.54

Threads fairness:
    events (avg/stddev):           5210386.0000/0.00
    execution time (avg/stddev):   119.4935/0.00

[SUCCESS] Single-core CPU benchmark completed

=====================================================================
MULTI-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-06 05:02:46] Running multi-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 4 eps: 172008.80 lat (ms,95%): 0.03
[ 20s ] thds: 4 eps: 175528.54 lat (ms,95%): 0.03
[ 30s ] thds: 4 eps: 176534.32 lat (ms,95%): 0.03
[ 40s ] thds: 4 eps: 176103.70 lat (ms,95%): 0.03
[ 50s ] thds: 4 eps: 174508.63 lat (ms,95%): 0.03
[ 60s ] thds: 4 eps: 176118.12 lat (ms,95%): 0.03
[ 70s ] thds: 4 eps: 176472.69 lat (ms,95%): 0.03
[ 80s ] thds: 4 eps: 176831.27 lat (ms,95%): 0.03
[ 90s ] thds: 4 eps: 175909.37 lat (ms,95%): 0.03
[ 100s ] thds: 4 eps: 173099.41 lat (ms,95%): 0.03
[ 110s ] thds: 4 eps: 177232.04 lat (ms,95%): 0.03
CPU speed:
    events per second: 175560.31

Throughput:
    events/s (eps):                      175560.3126
    time elapsed:                        120.0002s
    total number of events:              21067267

Latency (ms):
         min:                                    0.02
         avg:                                    0.02
         max:                                   27.12
         95th percentile:                        0.03
         sum:                               477715.86

Threads fairness:
    events (avg/stddev):           5266816.7500/68547.27
    execution time (avg/stddev):   119.4290/0.00

[SUCCESS] Multi-core CPU benchmark completed
[2025-06-06 05:04:46] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed
[2025-06-06 05:04:46] Preparing PostgreSQL test data...

=====================================================================
POSTGRESQL DATA PREPARATION
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 1000000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[SUCCESS] PostgreSQL test data preparation completed
[2025-06-06 05:06:17] Starting PostgreSQL benchmarks...

=====================================================================
READ-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 05:06:17] Running Read-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 4444.13 qps: 71108.54 (r/w/o: 62219.88/0.00/8888.65) lat (ms,95%): 1.39 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 4613.58 qps: 73819.91 (r/w/o: 64592.76/0.00/9227.15) lat (ms,95%): 1.25 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 4569.40 qps: 73110.08 (r/w/o: 63971.28/0.00/9138.80) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 4487.80 qps: 71803.74 (r/w/o: 62828.13/0.00/8975.60) lat (ms,95%): 1.39 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 4769.00 qps: 76303.18 (r/w/o: 66765.28/0.00/9537.90) lat (ms,95%): 1.18 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 4904.90 qps: 78478.30 (r/w/o: 68668.50/0.00/9809.80) lat (ms,95%): 1.04 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 4788.60 qps: 76618.43 (r/w/o: 67041.12/0.00/9577.30) lat (ms,95%): 1.16 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 4982.90 qps: 79726.58 (r/w/o: 69760.78/0.00/9965.80) lat (ms,95%): 0.90 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 4897.00 qps: 78352.51 (r/w/o: 68558.51/0.00/9794.00) lat (ms,95%): 1.14 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 4746.20 qps: 75939.59 (r/w/o: 66447.19/0.00/9492.40) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 4876.00 qps: 78015.60 (r/w/o: 68263.60/0.00/9752.00) lat (ms,95%): 1.08 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 4912.59 qps: 78601.66 (r/w/o: 68776.48/0.00/9825.18) lat (ms,95%): 1.06 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            7978978
        write:                           0
        other:                           1139854
        total:                           9118832
    transactions:                        569927 (4749.33 per sec.)
    queries:                             9118832 (75989.33 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      4749.3332
    time elapsed:                        120.0015s
    total number of events:              569927

Latency (ms):
         min:                                    0.65
         avg:                                    0.84
         max:                                   25.48
         95th percentile:                        1.18
         sum:                               479550.89

Threads fairness:
    events (avg/stddev):           142481.7500/3646.35
    execution time (avg/stddev):   119.8877/0.00

[SUCCESS] Read-Only benchmark completed

=====================================================================
WRITE-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 05:08:17] Running Write-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 950.25 qps: 5703.51 (r/w/o: 0.00/3802.61/1900.90) lat (ms,95%): 4.41 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 632.30 qps: 3793.82 (r/w/o: 0.00/2529.22/1264.61) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 548.40 qps: 3290.40 (r/w/o: 0.00/2193.60/1096.80) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 690.20 qps: 4140.40 (r/w/o: 0.00/2760.00/1380.40) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 495.80 qps: 2975.60 (r/w/o: 0.00/1984.00/991.60) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 740.70 qps: 4444.20 (r/w/o: 0.00/2962.80/1481.40) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 467.20 qps: 2803.20 (r/w/o: 0.00/1868.80/934.40) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 829.40 qps: 4975.50 (r/w/o: 0.00/3316.80/1658.70) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 397.30 qps: 2384.70 (r/w/o: 0.00/1590.00/794.70) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 797.60 qps: 4785.60 (r/w/o: 0.00/3190.40/1595.20) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 419.10 qps: 2514.60 (r/w/o: 0.00/1676.40/838.20) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 778.80 qps: 4672.80 (r/w/o: 0.00/3115.20/1557.60) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           309900
        other:                           154950
        total:                           464850
    transactions:                        77475  (645.61 per sec.)
    queries:                             464850 (3873.66 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      645.6099
    time elapsed:                        120.0028s
    total number of events:              77475

Latency (ms):
         min:                                    1.24
         avg:                                    6.19
         max:                                  174.28
         95th percentile:                       29.72
         sum:                               479932.88

Threads fairness:
    events (avg/stddev):           19368.7500/1.79
    execution time (avg/stddev):   119.9832/0.00

[SUCCESS] Write-Only benchmark completed

=====================================================================
READ-WRITE BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 05:10:17] Running Read-Write benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 200.29 qps: 4013.40 (r/w/o: 2809.66/802.76/400.98) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 451.70 qps: 9034.03 (r/w/o: 6323.82/1806.81/903.40) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 174.00 qps: 3478.90 (r/w/o: 2435.30/695.60/348.00) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 299.50 qps: 5991.10 (r/w/o: 4193.70/1198.40/599.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 435.30 qps: 8706.01 (r/w/o: 6094.20/1741.20/870.60) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 136.10 qps: 2722.00 (r/w/o: 1905.40/544.40/272.20) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 711.20 qps: 14224.00 (r/w/o: 9956.80/2844.80/1422.40) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 156.20 qps: 3124.00 (r/w/o: 2186.80/624.80/312.40) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 783.40 qps: 15667.50 (r/w/o: 10967.50/3133.20/1566.80) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 139.20 qps: 2784.50 (r/w/o: 1948.90/557.20/278.40) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 609.50 qps: 12190.00 (r/w/o: 8533.00/2438.00/1219.00) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 362.50 qps: 7250.00 (r/w/o: 5075.00/1450.00/725.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            624302
        write:                           178372
        other:                           89186
        total:                           891860
    transactions:                        44593  (371.57 per sec.)
    queries:                             891860 (7431.39 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      371.5695
    time elapsed:                        120.0126s
    total number of events:              44593

Latency (ms):
         min:                                    1.69
         avg:                                   10.76
         max:                                  210.63
         95th percentile:                       36.89
         sum:                               479986.90

Threads fairness:
    events (avg/stddev):           11148.2500/6.83
    execution time (avg/stddev):   119.9967/0.00

[SUCCESS] Read-Write benchmark completed

=====================================================================
OLTP POINT SELECT BENCHMARK
=====================================================================

[2025-06-06 05:12:17] Running OLTP Point Select benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            930985
        write:                           0
        other:                           0
        total:                           930985
    transactions:                        930985 (93092.64 per sec.)
    queries:                             930985 (93092.64 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      93092.6414
    time elapsed:                        10.0006s
    total number of events:              930985

Latency (ms):
         min:                                    0.02
         avg:                                    0.04
         max:                                   49.99
         95th percentile:                        0.06
         sum:                                39876.79

Threads fairness:
    events (avg/stddev):           232746.2500/5201.89
    execution time (avg/stddev):   9.9692/0.00

[SUCCESS] OLTP Point Select benchmark completed

=====================================================================
OLTP UPDATE INDEX BENCHMARK
=====================================================================

[2025-06-06 05:12:27] Running OLTP Update Index benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           15823
        other:                           0
        total:                           15823
    transactions:                        15823  (1581.95 per sec.)
    queries:                             15823  (1581.95 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1581.9521
    time elapsed:                        10.0022s
    total number of events:              15823

Latency (ms):
         min:                                    1.19
         avg:                                    2.53
         max:                                    4.53
         95th percentile:                        2.81
         sum:                                39996.95

Threads fairness:
    events (avg/stddev):           3955.7500/0.83
    execution time (avg/stddev):   9.9992/0.00

[SUCCESS] OLTP Update Index benchmark completed
[2025-06-06 05:12:37] Starting K6 benchmarks...
[2025-06-06 05:12:37] Truncating cache table...
TRUNCATE TABLE
[SUCCESS] Cache table truncated

=====================================================================
K6 AOT INSERT TEST
=====================================================================

[2025-06-06 05:12:37] Running K6 AOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 10448 complete and 0 interrupted iterations
default   [  10% ] 80 VUs  00m01.0s/10m0s  010448/100000 shared iters

running (00m02.0s), 80/80 VUs, 24356 complete and 0 interrupted iterations
default   [  24% ] 80 VUs  00m02.0s/10m0s  024356/100000 shared iters

running (00m03.0s), 80/80 VUs, 38253 complete and 0 interrupted iterations
default   [  38% ] 80 VUs  00m03.0s/10m0s  038253/100000 shared iters

running (00m04.0s), 80/80 VUs, 52362 complete and 0 interrupted iterations
default   [  52% ] 80 VUs  00m04.0s/10m0s  052362/100000 shared iters

running (00m05.0s), 80/80 VUs, 66386 complete and 0 interrupted iterations
default   [  66% ] 80 VUs  00m05.0s/10m0s  066386/100000 shared iters

running (00m06.0s), 80/80 VUs, 80655 complete and 0 interrupted iterations
default   [  81% ] 80 VUs  00m06.0s/10m0s  080655/100000 shared iters

running (00m07.0s), 80/80 VUs, 94805 complete and 0 interrupted iterations
default   [  95% ] 80 VUs  00m07.0s/10m0s  094805/100000 shared iters
time="2025-06-06T05:12:45Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-06T05:12:45Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=11.74ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  13573.485645/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=5.77ms min=190.7µs  med=4.92ms max=286.82ms p(90)=9.49ms p(95)=11.74ms
      { endpoint:postgres_insert }..............................................: avg=5.77ms min=190.7µs  med=4.92ms max=286.82ms p(90)=9.49ms p(95)=11.74ms
      { expected_response:true }................................................: avg=5.77ms min=190.7µs  med=4.92ms max=286.82ms p(90)=9.49ms p(95)=11.74ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 13573.62138/s

    EXECUTION
    iteration_duration..........................................................: avg=5.86ms min=231.92µs med=4.99ms max=287.47ms p(90)=9.63ms p(95)=11.89ms
    iterations..................................................................: 100000 13573.485645/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.2 MB/s
    data_sent...................................................................: 26 MB  3.5 MB/s



running (00m07.4s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m07.3s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Insert test completed

=====================================================================
K6 AOT QUERY TEST
=====================================================================

[2025-06-06 05:12:45] Running K6 AOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-06T05:12:45Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-06T05:12:45Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-06T05:12:45Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-06T05:12:45Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-06T05:12:45Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-06T05:12:45Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-06T05:12:45Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-06T05:12:45Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-06T05:12:45Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-06T05:12:45Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-06T05:12:45Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-06T05:12:45Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 14619 complete and 0 interrupted iterations
default   [  15% ] 80 VUs  00m01.0s/10m0s  014619/100000 shared iters

running (00m02.0s), 80/80 VUs, 30318 complete and 0 interrupted iterations
default   [  30% ] 80 VUs  00m02.0s/10m0s  030318/100000 shared iters

running (00m03.0s), 80/80 VUs, 45631 complete and 0 interrupted iterations
default   [  46% ] 80 VUs  00m03.0s/10m0s  045631/100000 shared iters

running (00m04.0s), 80/80 VUs, 61136 complete and 0 interrupted iterations
default   [  61% ] 80 VUs  00m04.0s/10m0s  061136/100000 shared iters

running (00m05.0s), 80/80 VUs, 76545 complete and 0 interrupted iterations
default   [  77% ] 80 VUs  00m05.0s/10m0s  076545/100000 shared iters

running (00m06.0s), 80/80 VUs, 92106 complete and 0 interrupted iterations
default   [  92% ] 80 VUs  00m06.0s/10m0s  092106/100000 shared iters
time="2025-06-06T05:12:52Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-06T05:12:52Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=9.95ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  46187.560167/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=5.04ms min=210.91µs med=4.44ms max=33.08ms p(90)=8.22ms p(95)=9.94ms 
      { endpoint:postgres_get }.............................................: avg=5.04ms min=210.91µs med=4.45ms max=33.08ms p(90)=8.22ms p(95)=9.95ms 
      { expected_response:true }............................................: avg=5.04ms min=210.91µs med=4.44ms max=33.08ms p(90)=8.22ms p(95)=9.94ms 
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 15411.403201/s

    EXECUTION
    iteration_duration......................................................: avg=5.15ms min=265.94µs med=4.52ms max=33.12ms p(90)=8.41ms p(95)=10.18ms
    iterations..............................................................: 100000 15395.853389/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  3.3 MB/s
    data_sent...............................................................: 13 MB  2.0 MB/s



running (00m06.5s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m06.5s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Query test completed

=====================================================================
K6 NAOT INSERT TEST
=====================================================================

[2025-06-06 05:12:52] Running K6 NAOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 3582 complete and 0 interrupted iterations
default   [   4% ] 80 VUs  00m01.0s/10m0s  003582/100000 shared iters

running (00m02.0s), 80/80 VUs, 13436 complete and 0 interrupted iterations
default   [  13% ] 80 VUs  00m02.0s/10m0s  013436/100000 shared iters

running (00m03.0s), 80/80 VUs, 23230 complete and 0 interrupted iterations
default   [  23% ] 80 VUs  00m03.0s/10m0s  023230/100000 shared iters

running (00m04.0s), 80/80 VUs, 32732 complete and 0 interrupted iterations
default   [  33% ] 80 VUs  00m04.0s/10m0s  032732/100000 shared iters

running (00m05.0s), 80/80 VUs, 43085 complete and 0 interrupted iterations
default   [  43% ] 80 VUs  00m05.0s/10m0s  043085/100000 shared iters

running (00m06.0s), 80/80 VUs, 56795 complete and 0 interrupted iterations
default   [  57% ] 80 VUs  00m06.0s/10m0s  056795/100000 shared iters

running (00m07.0s), 80/80 VUs, 71059 complete and 0 interrupted iterations
default   [  71% ] 80 VUs  00m07.0s/10m0s  071059/100000 shared iters

running (00m08.0s), 80/80 VUs, 85310 complete and 0 interrupted iterations
default   [  85% ] 80 VUs  00m08.0s/10m0s  085310/100000 shared iters

running (00m09.0s), 80/80 VUs, 99136 complete and 0 interrupted iterations
default   [  99% ] 80 VUs  00m09.0s/10m0s  099136/100000 shared iters
time="2025-06-06T05:13:01Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-06T05:13:01Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=13.33ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  11019.479262/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=7.12ms min=209.72µs med=5.96ms max=669.93ms p(90)=10.99ms p(95)=13.33ms
      { endpoint:postgres_insert }..............................................: avg=7.12ms min=209.72µs med=5.96ms max=669.93ms p(90)=10.99ms p(95)=13.33ms
      { expected_response:true }................................................: avg=7.12ms min=209.72µs med=5.96ms max=669.93ms p(90)=10.99ms p(95)=13.33ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 11019.589457/s

    EXECUTION
    iteration_duration..........................................................: avg=7.22ms min=242.91µs med=6.04ms max=673.4ms  p(90)=11.17ms p(95)=13.55ms
    iterations..................................................................: 100000 11019.479262/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.0 MB/s
    data_sent...................................................................: 26 MB  2.9 MB/s



running (00m09.1s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m09.1s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Insert test completed

=====================================================================
K6 NAOT QUERY TEST
=====================================================================

[2025-06-06 05:13:01] Running K6 NAOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-06T05:13:01Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-06T05:13:01Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-06T05:13:01Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-06T05:13:01Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-06T05:13:01Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-06T05:13:01Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-06T05:13:01Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-06T05:13:01Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-06T05:13:01Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-06T05:13:01Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-06T05:13:01Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-06T05:13:01Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 12974 complete and 0 interrupted iterations
default   [  13% ] 80 VUs  00m01.0s/10m0s  012974/100000 shared iters

running (00m02.0s), 80/80 VUs, 27877 complete and 0 interrupted iterations
default   [  28% ] 80 VUs  00m02.0s/10m0s  027877/100000 shared iters

running (00m03.0s), 80/80 VUs, 43576 complete and 0 interrupted iterations
default   [  44% ] 80 VUs  00m03.0s/10m0s  043576/100000 shared iters

running (00m04.0s), 80/80 VUs, 59661 complete and 0 interrupted iterations
default   [  60% ] 80 VUs  00m04.0s/10m0s  059661/100000 shared iters

running (00m05.0s), 80/80 VUs, 75334 complete and 0 interrupted iterations
default   [  75% ] 80 VUs  00m05.0s/10m0s  075334/100000 shared iters

running (00m06.0s), 80/80 VUs, 91045 complete and 0 interrupted iterations
default   [  91% ] 80 VUs  00m06.0s/10m0s  091045/100000 shared iters
time="2025-06-06T05:13:07Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-06T05:13:07Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=10.2ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  45671.888756/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=5.11ms min=169.17µs med=4.52ms max=35.03ms p(90)=8.44ms p(95)=10.2ms 
      { endpoint:postgres_get }.............................................: avg=5.12ms min=169.17µs med=4.52ms max=35.03ms p(90)=8.44ms p(95)=10.2ms 
      { expected_response:true }............................................: avg=5.11ms min=169.17µs med=4.52ms max=35.03ms p(90)=8.44ms p(95)=10.2ms 
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 15239.339121/s

    EXECUTION
    iteration_duration......................................................: avg=5.2ms  min=205.45µs med=4.59ms max=35.08ms p(90)=8.62ms p(95)=10.42ms
    iterations..............................................................: 100000 15223.962919/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  3.2 MB/s
    data_sent...............................................................: 13 MB  2.0 MB/s



running (00m06.6s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m06.5s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Query test completed
[SUCCESS] All available K6 benchmarks completed
[2025-06-06 05:13:07] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed

=====================================================================
BENCHMARK COMPLETION
=====================================================================
End Time: Fri Jun  6 05:13:08 UTC 2025
Duration: 12 minutes and 23 seconds
Results saved to: sysbench_results_r7a.xlarge_20250606_050045.txt
=====================================================================
[2025-06-06 05:13:08] ================================================
[SUCCESS] All benchmarks completed successfully!
[2025-06-06 05:13:08] Detailed results saved to: sysbench_results_r7a.xlarge_20250606_050045.txt